Revit 2027 API
ParameterTypeId.DefaultViewTemplate Property
 "View Template applied to new views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DefaultViewTemplate { get; }
Public Shared ReadOnly Property DefaultViewTemplate As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DefaultViewTemplate {
	ForgeTypeId^ get ();
}
static member DefaultViewTemplate : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace